{
  "exercises": [
    {
      "name": "Ab Crunch Machine",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "machine",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Select a light resistance and sit down on the ab machine placing your feet under the pads provided and grabbing the top handles. Your arms should be bent at a 90 degree angle as you rest the triceps on the pads provided. This will be your starting position.",
        "At the same time, begin to lift the legs up as you crunch your upper torso. Breathe out as you perform this movement. Tip: Be sure to use a slow and controlled motion. Concentrate on using your abs to move the weight while relaxing your legs and feet.",
        "After a second pause, slowly return to the starting position as you breathe in.",
        "Repeat the movement for the prescribed amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Ab Roller",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [
        "shoulders"
      ],
      "instructions": [
        "Hold the Ab Roller with both hands and kneel on the floor.",
        "Now place the ab roller on the floor in front of you so that you are on all your hands and knees (as in a kneeling push up position). This will be your starting position.",
        "Slowly roll the ab roller straight forward, stretching your body into a straight position. Tip: Go down as far as you can without touching the floor with your body. Breathe in during this portion of the movement.",
        "After a pause at the stretched position, start pulling yourself back to the starting position as you breathe out. Tip: Go slowly and keep your abs tight at all times."
      ],
      "category": "strength"
    },
    {
      "name": "Adductor/Groin",
      "force": "static",
      "level": "intermediate",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "adductors"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Lie on your back with your feet raised towards the ceiling.",
        "Have your partner hold your feet or ankles. Abduct your legs as far as you can. This will be your starting position.",
        "Attempt to squeeze your legs together for 10 or more seconds, while your partner prevents you from doing so.",
        "Now, relax the muscles in your legs as your partner pushes your feet apart, stretching as far as is comfortable for you. Be sure to let your partner know when the stretch is adequate to prevent overstretching or injury."
      ],
      "category": "stretching"
    },
    {
      "name": "Air Bike",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Lie flat on the floor with your lower back pressed to the ground. For this exercise, you will need to put your hands beside your head. Be careful however to not strain with the neck as you perform it. Now lift your shoulders into the crunch position.",
        "Bring knees up to where they are perpendicular to the floor, with your lower legs parallel to the floor. This will be your starting position.",
        "Now simultaneously, slowly go through a cycle pedal motion kicking forward with the right leg and bringing in the knee of the left leg. Bring your right elbow close to your left knee by crunching to the side, as you breathe out.",
        "Go back to the initial position as you breathe in.",
        "Crunch to the opposite side as you cycle your legs and bring closer your left elbow to your right knee and exhale.",
        "Continue alternating in this manner until all of the recommended repetitions for each side have been completed."
      ],
      "category": "strength"
    },
    {
      "name": "Arnold Dumbbell Press",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "triceps"
      ],
      "instructions": [
        "Sit on an exercise bench with back support and hold two dumbbells in front of you at about upper chest level with your palms facing your body and your elbows bent. Tip: Your arms should be next to your torso. The starting position should look like the contracted portion of a dumbbell curl.",
        "Now to perform the movement, raise the dumbbells as you rotate the palms of your hands until they are facing forward.",
        "Continue lifting the dumbbells until your arms are extended above you in straight arm position. Breathe out as you perform this portion of the movement.",
        "After a second pause at the top, begin to lower the dumbbells to the original position by rotating the palms of your hands towards you. Tip: The left arm will be rotated in a counter clockwise manner while the right one will be rotated clockwise. Breathe in as you perform this portion of the movement.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Ball Leg Curl",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "exercise ball",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes"
      ],
      "instructions": [
        "Begin on the floor laying on your back with your feet on top of the ball.",
        "Position the ball so that when your legs are extended your ankles are on top of the ball. This will be your starting position.",
        "Raise your hips off of the ground, keeping your weight on the shoulder blades and your feet.",
        "Flex the knees, pulling the ball as close to you as you can, contracting the hamstrings.",
        "After a brief pause, return to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Barbell Incline Bench Press - Medium Grip",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Lie back on an incline bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.",
        "As you breathe in, come down slowly until you feel the bar on you upper chest.",
        "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly again. Tip: it should take at least twice as long to go down than to come up.",
        "Repeat the movement for the prescribed amount of repetitions.",
        "When you are done, place the bar back in the rack."
      ],
      "category": "strength"
    },
    {
      "name": "Barbell Incline Shoulder Raise",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "chest"
      ],
      "instructions": [
        "Lie back on an Incline Bench. Using a medium width grip (a grip that is slightly wider than shoulder width), lift the bar from the rack and hold it straight over you with your arms straight. This will be your starting position.",
        "While keeping the arms straight, lift the bar by protracting your shoulder blades, raising the shoulders from the bench as you breathe out.",
        "Bring back the bar to the starting position as you breathe in.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Bench Dips",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "chest",
        "shoulders"
      ],
      "instructions": [
        "For this exercise you will need to place a bench behind your back. With the bench perpendicular to your body, and while looking away from it, hold on to the bench on its edge with the hands fully extended, separated at shoulder width. The legs will be extended forward, bent at the waist and perpendicular to your torso. This will be your starting position.",
        "Slowly lower your body as you inhale by bending at the elbows until you lower yourself far enough to where there is an angle slightly smaller than 90 degrees between the upper arm and the forearm. Tip: Keep the elbows as close as possible throughout the movement. Forearms should always be pointing down.",
        "Using your triceps to bring your torso up again, lift yourself back to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Bench Press - Powerlifting",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "chest",
        "forearms",
        "lats",
        "shoulders"
      ],
      "instructions": [
        "Begin by lying on the bench, getting your head beyond the bar if possible. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement.",
        "However wide your grip, it should cover the ring on the bar. Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart.",
        "Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.",
        "Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Bench Press - With Bands",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "bands",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Using a flat bench secure a band under the leg of the bench that is nearest to your head.",
        "Once the band is secure, grab it by both handles and lie down on the bench.",
        "Extend your arms so that you are holding the band handles in front of you at shoulder width.",
        "Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.",
        "Bring down the handles slowly until your elbow forms a 90 degree angle. Keep full control at all times.",
        "As you breathe out, bring the handles up using your pectoral muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.",
        "Repeat the movement for the prescribed amount of repetitions of your training program."
      ],
      "category": "strength"
    },
    {
      "name": "Bench Press with Chains",
      "force": "push",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "chest",
        "lats",
        "shoulders"
      ],
      "instructions": [
        "Adjust the leader chain, shortening it to the desired length.Place the chains on the sleeves of the bar.",
        "Lying on the bench, get your head beyond the bar if possible. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. However wide your grip, it should cover the ring on the bar.",
        "Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart. Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.",
        "Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Bent Over One-Arm Long Bar Row",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "biceps",
        "lats",
        "lower back",
        "traps"
      ],
      "instructions": [
        "Put weight on one of the ends of an Olympic barbell. Make sure that you either place the other end of the barbell in the corner of two walls; or put a heavy object on the ground so the barbell cannot slide backward.",
        "Bend forward until your torso is as close to parallel with the floor as you can and keep your knees slightly bent.",
        "Now grab the bar with one arm just behind the plates on the side where the weight was placed and put your other hand on your knee. This will be your starting position.",
        "Pull the bar straight up with your elbow in (to maximize back stimulation) until the plates touch your lower chest. Squeeze the back muscles as you lift the weight up and hold for a second at the top of the movement. Breathe out as you lift the weight. Tip: Do not allow for any swinging of the torso. Only the arm should move.",
        "Slowly lower the bar to the starting position getting a nice stretch on the lats. Tip: Do not let the plates touch the floor. To ensure the best range of motion, I recommend using small plates (25-lb ones) as opposed to larger plates (like 35-45lb ones).",
        "Repeat for the recommended amount of repetitions and switch arms."
      ],
      "category": "strength"
    },
    {
      "name": "Bent Over Two-Dumbbell Row",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "biceps",
        "lats",
        "shoulders"
      ],
      "instructions": [
        "With a dumbbell in each hand (palms facing your torso), bend your knees slightly and bring your torso forward by bending at the waist; as you bend make sure to keep your back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.",
        "While keeping the torso stationary, lift the dumbbells to your side (as you breathe out), keeping the elbows close to the body (do not exert any force with the forearm other than holding the weights). On the top contracted position, squeeze the back muscles and hold for a second.",
        "Slowly lower the weight again to the starting position as you inhale.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Bicycling",
      "force": null,
      "level": "beginner",
      "mechanic": null,
      "equipment": "other",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "To begin, seat yourself on the bike and adjust the seat to your height."
      ],
      "category": "cardio"
    },
    {
      "name": "Body-Up",
      "force": "push",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "body only",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "abdominals",
        "forearms"
      ],
      "instructions": [
        "Assume a plank position on the ground. You should be supporting your bodyweight on your toes and forearms, keeping your torso straight. Your forearms should be shoulder-width apart. This will be your starting position.",
        "Pressing your palms firmly into the ground, extend through the elbows to raise your body from the ground. Keep your torso rigid as you perform the movement.",
        "Slowly lower your forearms back to the ground by allowing the elbows to flex.",
        "Repeat."
      ],
      "category": "strength"
    },
    {
      "name": "Box Squat with Bands",
      "force": "push",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "abductors",
        "adductors",
        "calves",
        "glutes",
        "hamstrings",
        "lower back"
      ],
      "instructions": [
        "Begin in a power rack with a box at the appropriate height behind you. Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension. If dumbbells are used, secure them so that they don't move. Also, ensure that the dumbbells you are using are heavy enough for the bands that you are using. Additional plates can be used to hold the dumbbells down. If more tension is needed, you can either widen the base on the floor or choke the bands. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.",
        "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.",
        "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.",
        "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Butterfly",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "machine",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Sit on the machine with your back flat on the pad.",
        "Take hold of the handles. Tip: Your upper arms should be positioned parallel to the floor; adjust the machine accordingly. This will be your starting position.",
        "Push the handles together slowly as you squeeze your chest in the middle. Breathe out during this part of the motion and hold the contraction for a second.",
        "Return back to the starting position slowly as you inhale until your chest muscles are fully stretched.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Cable Iron Cross",
      "force": "push",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "cable",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Begin by moving the pulleys to the high position, select the resistance to be used, and take a handle in each hand.",
        "Stand directly between both pulleys with your arms extended out to your sides. Your head and chest should be up while your arms form a â€œTâ€. This will be your starting position.",
        "Keeping the elbows extended, pull your arms straight to your sides.",
        "Return your arms back to the starting position after a pause at the peak contraction.",
        "Continue the movement for the prescribed number of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Cable Preacher Curl",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "cable",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [
        "forearms"
      ],
      "instructions": [
        "Place a preacher bench about 2 feet in front of a pulley machine.",
        "Attach a straight bar to the low pulley.",
        "Sit at the preacher bench with your elbow and upper arms firmly on top of the bench pad and have someone hand you the bar from the low pulley.",
        "Grab the bar and fully extend your arms on top of the preacher bench pad. This will be your starting position.",
        "Now start pilling the weight up towards your shoulders and squeeze the biceps hard at the top of the movement. Exhale as you perform this motion. Also, hold for a second at the top.",
        "Now slowly lower the weight to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Cable Shoulder Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "cable",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "triceps"
      ],
      "instructions": [
        "Move the cables to the bottom of the towers and select an appropriate weight.",
        "Stand directly in between the uprights. Grasp the cables and hold them at shoulder height, palms facing forward. This will be your starting position.",
        "Keeping your head and chest up, extend through the elbow to press the handles directly over head.",
        "After pausing at the top, return to the starting position and repeat."
      ],
      "category": "strength"
    },
    {
      "name": "Calf Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "machine",
      "primaryMuscles": [
        "calves"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Adjust the seat so that your legs are only slightly bent in the start position. The balls of your feet should be firmly on the platform.",
        "Select an appropriate weight, and grasp the handles. This will be your starting position.",
        "Straighten the legs by extending the knees, just barely lifting the weight from the stack. Your ankle should be fully flexed, toes pointing up. Execute the movement by pressing downward through the balls of your feet as far as possible.",
        "After a brief pause, reverse the motion and repeat."
      ],
      "category": "strength"
    },
    {
      "name": "Carioca Quick Step",
      "force": null,
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "adductors"
      ],
      "secondaryMuscles": [
        "abdominals",
        "abductors",
        "calves",
        "glutes",
        "hamstrings",
        "quadriceps"
      ],
      "instructions": [
        "Begin with your feet a few inches apart and your left arm up in a relaxed, athletic position.",
        "With your right foot, quick step behind and pull the knee up.",
        "Fire your arms back up when you pull the right knee, being sure that your knee goes straight up and down. Avoid turning your feet as you move and continue to look forward as you move to the side."
      ],
      "category": "plyometrics"
    },
    {
      "name": "Chin-Up",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "lats"
      ],
      "secondaryMuscles": [
        "biceps",
        "forearms",
        "middle back"
      ],
      "instructions": [
        "Grab the pull-up bar with the palms facing your torso and a grip closer than the shoulder width.",
        "As you have both arms extended in front of you holding the bar at the chosen grip width, keep your torso as straight as possible while creating a curvature on your lower back and sticking your chest out. This is your starting position. Tip: Keeping the torso as straight as possible maximizes biceps stimulation while minimizing back involvement.",
        "As you breathe out, pull your torso up until your head is around the level of the pull-up bar. Concentrate on using the biceps muscles in order to perform the movement. Keep the elbows close to your body. Tip: The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.",
        "After a second of squeezing the biceps in the contracted position, slowly lower your torso back to the starting position; when your arms are fully extended. Breathe in as you perform this portion of the movement.",
        "Repeat this motion for the prescribed amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Clean Deadlift",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "forearms",
        "glutes",
        "lower back",
        "middle back",
        "quadriceps",
        "traps"
      ],
      "instructions": [
        "Begin standing with a barbell close to your shins. Your feet should be directly under your hips with your feet turned out slightly. Grip the bar with a double overhand grip or hook grip, about shoulder width apart. Squat down to the bar. Your spine should be in full extension, with a back angle that places your shoulders in front of the bar and your back as vertical as possible.",
        "Begin by driving through the floor through the front of your heels. As the bar travels upward, maintain a constant back angle. Flare your knees out to the side to help keep them out of the bar's path.",
        "After the bar crosses the knees, complete the lift by driving the hips into the bar until your hips and knees are extended."
      ],
      "category": "olympic weightlifting"
    },
    {
      "name": "Close-Grip Dumbbell Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "chest",
        "shoulders"
      ],
      "instructions": [
        "Place a dumbbell standing up on a flat bench.",
        "Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench with only your shoulders lying on the surface. Hips should be below the bench and your legs bent with your feet firmly on the floor.",
        "Grasp the dumbbell with both hands and hold it straight over your chest at armâ€™s length. Both palms should be pressing against the underside of the sides of the dumbbell. This will be your starting position.",
        "Initiate the movement by lowering the dumbbell to your chest.",
        "Return to the starting position by extending the elbows."
      ],
      "category": "strength"
    },
    {
      "name": "Cross Body Hammer Curl",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [
        "forearms"
      ],
      "instructions": [
        "Stand up straight with a dumbbell in each hand. Your hands should be down at your side with your palms facing in.",
        "While keeping your palms facing in and without twisting your arm, curl the dumbbell of the right arm up towards your left shoulder as you exhale. Touch the top of the dumbbell to your shoulder and hold the contraction for a second.",
        "Slowly lower the dumbbell along the same path as you inhale and then repeat the same movement for the left arm.",
        "Continue alternating in this fashion until the recommended amount of repetitions is performed for each arm."
      ],
      "category": "strength"
    },
    {
      "name": "Deadlift with Bands",
      "force": "pull",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "lower back"
      ],
      "secondaryMuscles": [
        "forearms",
        "glutes",
        "hamstrings",
        "middle back",
        "quadriceps",
        "traps"
      ],
      "instructions": [
        "To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. For long bands, they will need to be anchored to a secure base, such as heavy dumbbells or a rack.",
        "With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.",
        "Lower the bar by bending at the hips and guiding it to the floor."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Deadlift with Chains",
      "force": "pull",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "lower back"
      ],
      "secondaryMuscles": [
        "forearms",
        "glutes",
        "hamstrings",
        "middle back",
        "quadriceps",
        "traps"
      ],
      "instructions": [
        "You can attach the chains to the sleeves of the bar, or just drape the middle over the bar so there is a greater weight increase as you lift.",
        "Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets. With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar.",
        "Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.",
        "Lower the bar by bending at the hips and guiding it to the floor."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Dead Bug",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Begin lying on your back with your hands extended above you toward the ceiling.",
        "Bring your feet, knees, and hips up to 90 degrees.",
        "Exhale hard to bring your ribcage down and flatten your back onto the floor, rotating your pelvis up and squeezing your glutes. Hold this position throughout the movement. This will be your starting position.",
        "Initiate the exercise by extending one leg, straightening the knee and hip to bring the leg just above the ground.",
        "Maintain the position of your lumbar and pelvis as you perform the movement, as your back is going to want to arch.",
        "Stay tight and return the working leg to the starting position.",
        "Repeat on the opposite side, alternating until the set is complete."
      ],
      "category": "strength"
    },
    {
      "name": "Decline Barbell Bench Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Secure your legs at the end of the decline bench and slowly lay down on the bench.",
        "Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack.",
        "As you breathe in, come down slowly until you feel the bar on your lower chest.",
        "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).",
        "Repeat the movement for the prescribed amount of repetitions.",
        "When you are done, place the bar back in the rack."
      ],
      "category": "strength"
    },
    {
      "name": "Depth Jump Leap",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "abductors",
        "adductors",
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "For this drill you will need two boxes or benches, one 12 to 16 inches high and the other 22 to 26 inches high.",
        "Stand on one of the two boxes with arms at the sides; feet should be together and slightly off the edge as in the depth jump. Place the other box approximately two or three feet in front of and facing the performer.",
        "Begin by dropping off the initial box, landing and simultaneously taking off with both feet.",
        "Rebound by driving upward and outward as intensely as possible, using the arms and full extension of the body to jump onto the higher box. Again, allow the legs to absorb the impact."
      ],
      "category": "plyometrics"
    },
    {
      "name": "Donkey Calf Raises",
      "force": "push",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "other",
      "primaryMuscles": [
        "calves"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "For this exercise you will need access to a donkey calf raise machine. Start by positioning your lower back and hips under the padded lever provided. The tailbone area should be the one making contact with the pad.",
        "Place both of your arms on the side handles and place the balls of your feet on the calf block with the heels extending off. Align the toes forward, inward or outward, depending on the area you wish to target, and straighten the knees without locking them. This will be your starting position.",
        "Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down.",
        "Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Double Kettlebell Windmill",
      "force": "pull",
      "level": "intermediate",
      "mechanic": null,
      "equipment": "kettlebells",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [
        "glutes",
        "hamstrings",
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Place a kettlebell in front of your front foot and clean and press a kettlebell overhead with your opposite arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Rotate your wrist as you do so, so that the palm faces forward.",
        "Keeping the kettlebell locked out at all times, push your butt out in the direction of the locked out kettlebell. Turn your feet out at a forty-five degree angle from the arm with the locked out kettlebell.",
        "Bending at the hip to one side, sticking your butt out, slowly lean until you can retrieve the kettlebell from the floor. Keep your eyes on the kettlebell that you hold over your head at all times.",
        "Pause for a second after retrieving the kettlebell from the ground and reverse the motion back to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Dumbbell Floor Press",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "chest",
        "shoulders"
      ],
      "instructions": [
        "Lay on the floor holding dumbbells in your hands. Your knees can be bent. Begin with the weights fully extended above you.",
        "Lower the weights until your upper arm comes in contact with the floor. You can tuck your elbows to emphasize triceps size and strength, or to focus on your chest angle your arms to the side.",
        "Pause at the bottom, and then bring the weight together at the top by extending through the elbows."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Elevated Cable Rows",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "cable",
      "primaryMuscles": [
        "lats"
      ],
      "secondaryMuscles": [
        "middle back",
        "traps"
      ],
      "instructions": [
        "Get a platform of some sort (it can be an aerobics or calf raise platform) that is around 4-6 inches in height.",
        "Place it on the seat of the cable row machine.",
        "Sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.",
        "Lean over as you keep the natural alignment of your back and grab the V-bar handles.",
        "With your arms extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lats as you hold the bar in front of you. This is the starting position of the exercise.",
        "Keeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it until you touch the abdominals. Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard. Hold that contraction for a second and slowly go back to the original position while breathing in.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "EZ-Bar Skullcrusher",
      "force": "push",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "e-z curl bar",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "forearms"
      ],
      "instructions": [
        "Using a close grip, lift the EZ bar and hold it with your elbows in as you lie on the bench. Your arms should be perpendicular to the floor. This will be your starting position.",
        "Keeping the upper arms stationary, lower the bar by allowing the elbows to flex. Inhale as you perform this portion of the movement. Pause once the bar is directly above the forehead.",
        "Lift the bar back to the starting position by extending the elbow and exhaling.",
        "Repeat."
      ],
      "category": "strength"
    },
    {
      "name": "Face Pull",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "cable",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "middle back"
      ],
      "instructions": [
        "Facing a high pulley with a rope or dual handles attached, pull the weight directly towards your face, separating your hands as you do so. Keep your upper arms parallel to the ground."
      ],
      "category": "strength"
    },
    {
      "name": "Flat Bench Cable Flyes",
      "force": "push",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "cable",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Position a flat bench between two low pulleys so that when you are laying on it, your chest will be lined up with the cable pulleys.",
        "Lay flat on the bench and keep your feet on the ground.",
        "Have someone hand you the handles on each hand. You will grab each single handle attachment with a palms up grip.",
        "Extend your arms by your side with a slight bend on your elbows. Tip: You will keep this bend constant through the whole movement. Your arms should be parallel to the floor. This is your starting position.",
        "Now start lifting the arms in a semi-circle motion directly in front of you by pulling the cables together until both hands meet at the top of the movement. Squeeze your chest as you perform this motion and breathe out during this movement. Also, hold the contraction for a second at the top. Tip: When performed correctly, at the top position of this movement, your arms should be perpendicular to your torso and the floor touching above your chest.",
        "Slowly come back to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Frankenstein Squat",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "abdominals",
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "This drill teaches you the proper positioning of both the bar and your body during the clean and front squat.",
        "Place the barbell on the front of the shoulders, releasing your grip and extending your arms out in front of you. The shoulders should be pushed forward to create a shelf, and the bar should be in contact with the throat. Ensure that you only move your shoulder blades forward; don't round the thoracic spine.",
        "Squat by flexing the knees and hips, sitting in between your legs. Keep the torso upright, the arms up, and the shoulders forward, and the bar should stay in place. Go to the bottom of the squat, until your hamstrings contact your calves.",
        "Return to the upright position by driving through the front of the heel and extending the knees and hips."
      ],
      "category": "olympic weightlifting"
    },
    {
      "name": "Frog Sit-Ups",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "body only",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Lie with your back flat on the floor (or exercise mat) and your legs extended in front of you.",
        "Now bend at the knees and place your outer thighs by the floor (or mat) as you make the soles of your feet touch each other.",
        "Now try pushing both soles and bringing them up as near you as possible while you keep the outer thighs on the floor (or at least almost touching it). Tip: In this position your legs should create a diamond shape.",
        "Now, cross your arms in front of you by touching the opposite shoulders. This will be your starting position.",
        "As you exhale flatten your lower back to the floor while curling the torso upwards. Tip: This will be like performing the first 1/4 movement of a sit up. Hold at the top position for a second.",
        "As you inhale, slowly lower back to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Front Barbell Squat To A Bench",
      "force": "push",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "This exercise is best performed inside a squat rack for safety purposes. To begin, first set a flat bench behind you and set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.",
        "Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.",
        "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).",
        "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until you touch the bench with your glutes. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
        "Begin to raise the bar as you exhale by pushing the floor mainly with the heel of your foot as you straighten the legs again and go back to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Front Squats With Two Kettlebells",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes"
      ],
      "instructions": [
        "Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so.",
        "Looking straight ahead at all times, squat as low as you can and pause at the bottom. As you squat down, push your knees out. You should squat between your legs, keeping an upright torso, with your head and chest up.",
        "Rise back up by driving through your heels and repeat."
      ],
      "category": "strength"
    },
    {
      "name": "Glute Kickback",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "glutes"
      ],
      "secondaryMuscles": [
        "hamstrings"
      ],
      "instructions": [
        "Kneel on the floor or an exercise mat and bend at the waist with your arms extended in front of you (perpendicular to the torso) in order to get into a kneeling push-up position but with the arms spaced at shoulder width. Your head should be looking forward and the bend of the knees should create a 90-degree angle between the hamstrings and the calves. This will be your starting position.",
        "As you exhale, lift up your right leg until the hamstrings are in line with the back while maintaining the 90-degree angle bend. Contract the glutes throughout this movement and hold the contraction at the top for a second. Tip: At the end of the movement the upper leg should be parallel to the floor while the calf should be perpendicular to it.",
        "Go back to the initial position as you inhale and now repeat with the left leg.",
        "Continue to alternate legs until all of the recommended repetitions have been performed."
      ],
      "category": "strength"
    },
    {
      "name": "Groiners",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "adductors"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Begin in a pushup position on the floor. This will be your starting position.",
        "Using both legs, jump forward landing with your feet next to your hands. Keep your head up as you do so.",
        "Return to the starting position and immediately repeat the movement, continuing for 10-20 repetitions."
      ],
      "category": "stretching"
    },
    {
      "name": "Groin and Back Stretch",
      "force": "static",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": null,
      "primaryMuscles": [
        "adductors"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Sit on the floor with your knees bent and feet together.",
        "Interlock your fingers behind your head. This will be your starting position.",
        "Curl downwards, bringing your elbows to the inside of your thighs. After a brief pause, return to the starting position with your head up and your back straight. Repeat for 10-20 repetitions."
      ],
      "category": "stretching"
    },
    {
      "name": "Hammer Curls",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso.",
        "The palms of the hands should be facing your torso. This will be your starting position.",
        "Now, while holding your upper arm stationary, exhale and curl the weight forward while contracting the biceps. Continue to raise the weight until the biceps are fully contracted and the dumbbell is at shoulder level. Hold the contracted position for a brief moment as you squeeze the biceps. Tip: Focus on keeping the elbow stationary and only moving your forearm.",
        "After the brief pause, inhale and slowly begin the lower the dumbbells back down to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Hammer Grip Incline DB Bench Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Lie back on an incline bench with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.",
        "By using your thighs to help you get the dumbbells up, clean the dumbbells one arm at a time so that you can hold them at shoulder width.",
        "Once at shoulder width, keep the palms of your hands with a neutral grip (palms facing each other). Keep your elbows flared out with the upper arms in line with the shoulders (perpendicular to the torso) and the elbows bent creating a 90-degree angle between the upper arm and the forearm. This will be your starting position.",
        "Now bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbells at all times.",
        "As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.",
        "Repeat the movement for the prescribed amount of repetitions.",
        "When you are done, place the dumbbells back in your thighs and then on the floor. This is the safest manner to dispose of the dumbbells."
      ],
      "category": "strength"
    },
    {
      "name": "Handstand Push-Ups",
      "force": "push",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "triceps"
      ],
      "instructions": [
        "With your back to the wall bend at the waist and place both hands on the floor at shoulder width.",
        "Kick yourself up against the wall with your arms straight. Your body should be upside down with the arms and legs fully extended. Keep your whole body as straight as possible. Tip: If doing this for the first time, have a spotter help you. Also, make sure that you keep facing the wall with your head, rather than looking down.",
        "Slowly lower yourself to the ground as you inhale until your head almost touches the floor. Tip: It is of utmost importance that you come down slow in order to avoid head injury.",
        "Push yourself back up slowly as you exhale until your elbows are nearly locked.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Heaving Snatch Balance",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "abdominals",
        "forearms",
        "glutes",
        "hamstrings",
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "This drill helps you learn the snatch. Begin by holding a light weight across the back of the shoulders. Your feet should be slightly wider than hip width apart with the feet turned out, the same position that you would perform a squat with.",
        "Begin by dipping with the knees slightly, and popping back up to briefly unload the bar. Drive yourself underneath the bar, elevating it overhead as you descend into a full squat.",
        "Return to a standing position."
      ],
      "category": "olympic weightlifting"
    },
    {
      "name": "Hip Extension with Bands",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "bands",
      "primaryMuscles": [
        "glutes"
      ],
      "secondaryMuscles": [
        "hamstrings"
      ],
      "instructions": [
        "Secure one end of the band to the lower portion of a post and attach the other to one ankle.",
        "Facing the attachment point of the band, hold on to the column to stabilize yourself.",
        "Keeping your head and your chest up, move the resisted leg back as far as you can while keeping the knee straight.",
        "Return the leg to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Inchworm",
      "force": null,
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Stand with your feet close together. Keeping your legs straight, stretch down and put your hands on the floor directly in front of you. This will be your starting position.",
        "Begin by walking your hands forward slowly, alternating your left and your right. As you do so, bend only at the hip, keeping your legs straight.",
        "Keep going until your body is parallel to the ground in a pushup position.",
        "Now, keep your hands in place and slowly take short steps with your feet, moving only a few inches at a time.",
        "Continue walking until your feet are by hour hands, keeping your legs straight as you do so."
      ],
      "category": "stretching"
    },
    {
      "name": "Incline Bench Pull",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "barbell",
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "lats",
        "shoulders"
      ],
      "instructions": [
        "Grab a dumbbell in each hand and lie face down on an incline bench that is set to an incline that is approximately 30 degrees.",
        "Let the arms hang to your sides fully extended as they point to the floor.",
        "Turn the wrists until your hands have a pronated (palms down) grip.",
        "Now flare the elbows out. This will be your starting position.",
        "As you breathe out, start to pull the dumbbells up as if you are doing a reverse bench press. You will do this by bending at the elbows and bringing the upper arms up as you let the forearms hang. Continue this motion until the upper arms are at the same level as your back. Tip: The elbows will come out to the side and your upper arms and torso should make the letter \"T\" at the top of the movement. Hold the contraction at the top for a second.",
        "Slowly go back down to the starting position as you breathe in.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Incline Dumbbell Bench With Palms Facing In",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Lie back on an incline bench with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.",
        "By using your thighs to help you get the dumbbells up, clean the dumbbells one arm at a time so that you can hold them at shoulder width.",
        "Once at shoulder width, keep the palms of your hands with a neutral grip (palms facing each other). Keep your elbows flared out with the upper arms in line with the shoulders (perpendicular to the torso) and the elbows bent creating a 90-degree angle between the upper arm and the forearm. This will be your starting position.",
        "Now bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbells at all times.",
        "As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.",
        "Repeat the movement for the prescribed amount of repetitions.",
        "When you are done, place the dumbbells back in your thighs and then on the floor. This is the safest manner to dispose of the dumbbells."
      ],
      "category": "strength"
    },
    {
      "name": "Incline Hammer Curls",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position.",
        "Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary.",
        "Continue to the top of the movement and pause, then slowly return to the start position."
      ],
      "category": "strength"
    },
    {
      "name": "Incline Push-Up Reverse Grip",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "abdominals",
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Stand facing a Smith machine bar or sturdy elevated platform at an appropriate height.",
        "Place your hands on the bar palms up, with your hands about shoulder width apart.",
        "Position your feet back from the bar with arms and body straight. This will be your starting position.",
        "Keeping your body straight, lower your chest to the bar by bending the arms.",
        "Return to the starting position by extending the elbows, pressing yourself back up."
      ],
      "category": "strength"
    },
    {
      "name": "Inverted Row",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": null,
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "lats"
      ],
      "instructions": [
        "Position a bar in a rack to about waist height. You can also use a smith machine.",
        "Take a wider than shoulder width grip on the bar and position yourself hanging underneath the bar. Your body should be straight with your heels on the ground with your arms fully extended. This will be your starting position.",
        "Begin by flexing the elbow, pulling your chest towards the bar. Retract your shoulder blades as you perform the movement.",
        "Pause at the top of the motion, and return yourself to the start position.",
        "Repeat for the desired number of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Isometric Wipers",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "abdominals",
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Assume a push-up position, supporting your weight on your hands and toes while keeping your body straight. Your hands should be just outside of shoulder width. This will be your starting position.",
        "Begin by shifting your body weight as far to one side as possible, allowing the elbow on that side to flex as you lower your body.",
        "Reverse the motion by extending the flexed arm, pushing yourself up and then dropping to the other side.",
        "Repeat for the desired number of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Jefferson Squats",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings",
        "lower back",
        "traps"
      ],
      "instructions": [
        "Place a barbell on the floor.",
        "Stand in the middle of the bar length wise.",
        "Bend down by bending at the knees and keeping your back straight and grasp the front of the bar with your right hand. Your palm should be in (neutral grip) facing the left side.",
        "Grasp the rear of the bar with your left hand. The palm of your hand should be in neutral grip alignment (palms facing the right side). Tip: Ensure that your grip is even on the bar. Your torso should be positioned right in the middle of the bar and the distance between your torso and your right hand (which should be at the front) should be the same as the distance between your torso and your left hand (which should be to your back).",
        "Now stand straight up with the weight. Tip: Your feet should be shoulder width apart and your toes slightly pointed out.",
        "Squat down by bending at the knees and keeping your back straight until your upper thighs are parallel with the floor. Tip: Keep your back as vertical as possible with the floor and your head up. Also remember to not let your knees go past your toes. Inhale during this portion of the movement.",
        "Now drive yourself back up to the starting position by pushing with the feet . Tip: Keep the bar hanging at arm's length and your elbows locked with a slight bend. The arms only serve as hooks. Avoid doing any lifting with them. Do the lifting with your thighs; not your arms."
      ],
      "category": "strength"
    },
    {
      "name": "Jerk Balance",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "glutes",
        "hamstrings",
        "quadriceps",
        "triceps"
      ],
      "instructions": [
        "This drill helps you learn to drive yourself low enough during the jerk and corrects those who move backward during the movement. Begin with the bar racked in the jerk position, with the shoulders forward, torso upright, and the feet split slightly apart.",
        "Initiate the movement as you would a normal jerk, dipping at the knees while keeping your torso vertical, and driving back up forcefully, using momentum and not your arms to elevate the weight.",
        "Keep the rear foot in place, using it to drive your body forward into a full split as you jerk the weight. Recover by standing up with the weight overhead."
      ],
      "category": "olympic weightlifting"
    },
    {
      "name": "Jerk Dip Squat",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "abdominals",
        "calves"
      ],
      "instructions": [
        "This movement strengthens the dip portion of the jerk. Begin with the bar racked in the jerk position, with the shoulders forward to create a shelf and the bar lightly contacting the throat. The feet should be directly under the hips, with the feet turned out as is comfortable.",
        "Keeping the torso vertical, dip by flexing the knees, allowing them to travel forward and without moving the hips to the rear. The dip should not be excessive. Return the weight to the starting position by driving forcefully though the feet."
      ],
      "category": "olympic weightlifting"
    },
    {
      "name": "Keg Load",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "lower back"
      ],
      "secondaryMuscles": [
        "abdominals",
        "biceps",
        "calves",
        "forearms",
        "glutes",
        "hamstrings",
        "middle back",
        "quadriceps",
        "shoulders",
        "traps"
      ],
      "instructions": [
        "To load kegs, place the desired number a distance from the loading platform, typically 30-50 feet.",
        "Begin by grabbing the close handle of the first keg, tilting it onto its side to grab the opposite edge of the bottom of the keg. Lift the keg up to your chest.",
        "The higher you can place the keg, the faster you should be able to move to the platform. Shouldering is usually not allowed. Be sure to keep a firm hold on the keg. Move as quickly as possible to the platform, and load it, extending through your hips, knees, and ankles to get it as high as possible.",
        "Return to the starting position to retrieve the next keg, and repeat until the event is completed."
      ],
      "category": "strongman"
    },
    {
      "name": "Kettlebell Arnold Press",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "triceps"
      ],
      "instructions": [
        "Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulder by extending through the legs and hips as you raise the kettlebell towards your shoulder. The palm should be facing inward.",
        "Looking straight ahead, press the kettlebell out and overhead, rotating your wrist so that your palm faces forward at the top of the motion.",
        "Return the kettlebell to the starting position, with the palm facing in."
      ],
      "category": "strength"
    },
    {
      "name": "Kettlebell Pass Between The Legs",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [
        "glutes",
        "hamstrings",
        "shoulders"
      ],
      "instructions": [
        "Place one kettlebell between your legs and take a comfortable stance. Bend over by pushing your butt out and keeping your back flat.",
        "Pick up a kettlebell and pass it to your other hand between your legs, in the fashion of a \"W\". Go back and forth for several repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Kettlebell Pistol Squat",
      "force": "push",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings",
        "shoulders"
      ],
      "instructions": [
        "Pick up a kettlebell with two hands and hold it by the horns. Hold one leg off of the floor and squat down on the other.",
        "Squat down by flexing the knee and sitting back with the hips, holding the kettlebell up in front of you.",
        "Hold the bottom position for a second and then reverse the motion, driving through the heel and keeping your head and chest up.",
        "Lower yourself again and repeat."
      ],
      "category": "strength"
    },
    {
      "name": "Kettlebell Thruster",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "quadriceps",
        "triceps"
      ],
      "instructions": [
        "Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so. This will be your starting position.",
        "Begin to squat by flexing your hips and knees, lowering your hips between your legs. Maintain an upright, straight back as you descend as low as you can.",
        "At the bottom, reverse direction and squat by extending your knees and hips, driving through your heels. As you do so, press both kettlebells overhead by extending your arms straight up, using the momentum from the squat to help drive the weights upward.",
        "As you begin the next repetition, return the weights to the shoulders."
      ],
      "category": "strength"
    },
    {
      "name": "Kettlebell Turkish Get-Up (Squat style)",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "abdominals",
        "calves",
        "hamstrings",
        "quadriceps",
        "triceps"
      ],
      "instructions": [
        "Lie on your back on the floor and press a kettlebell to the top position by extending the elbow. Bend the knee on the same side as the kettlebell.",
        "Keeping the kettlebell locked out at all times, pivot to the opposite side and use your non- working arm to assist you in driving forward to the lunge position.",
        "Using your free hand, push yourself to a seated position, then progressing to your feet. While looking up at the kettlebell, slowly stand up. Reverse the motion back to the starting position and repeat."
      ],
      "category": "strength"
    },
    {
      "name": "Kneeling Arm Drill",
      "force": "pull",
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "abdominals"
      ],
      "instructions": [
        "This drill helps increase arm efficiency during the run. Begin kneeling, left foot in front, right knee down. Apply pressure through the front heel to keep your glutes and hamstrings activated.",
        "Begin by blocking the arms in long, pendulum like swings. Close the arm angle, blocking with the arms as you would when jogging, progressing to a run and finally a sprint.",
        "As soon as your hands pass the hip, accelerate them forward during the sprinting motion to move them as quickly as possible.",
        "Switch knees and repeat."
      ],
      "category": "plyometrics"
    },
    {
      "name": "Kneeling Squat",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "glutes"
      ],
      "secondaryMuscles": [
        "abdominals",
        "hamstrings",
        "lower back"
      ],
      "instructions": [
        "Set the bar to the proper height in a power rack. Kneel behind the bar; it may be beneficial to put a mat down to pad your knees. Slide under the bar, racking it across the back of your shoulders. Your shoulder blades should be retracted and the bar tight across your back. Unrack the weight.",
        "With your head looking forward, sit back with your butt until you touch your calves.",
        "Reverse the motion, returning the torso to an upright position."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Knee Tuck Jump",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "abductors",
        "adductors",
        "calves",
        "glutes",
        "quadriceps"
      ],
      "instructions": [
        "Begin in a comfortable standing position with your knees slightly bent. Hold your hands in front of you, palms down with your fingertips together at chest height. This will be your starting position.",
        "Rapidly dip down into a quarter squat and immediately explode upward. Drive the knees towards the chest, attempting to touch them to the palms of the hands.",
        "Jump as high as you can, raising your knees up, and then ensure a good land be re-extending your legs, absorbing impact through be allowing the knees to rebend."
      ],
      "category": "plyometrics"
    },
    {
      "name": "Landmine Linear Jammer",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "abdominals",
        "calves",
        "chest",
        "hamstrings",
        "quadriceps",
        "triceps"
      ],
      "instructions": [
        "Position a bar into landmine or, lacking one, securely anchor it in a corner. Load the bar to an appropriate weight and position the handle attachment on the bar.",
        "Raise the bar from the floor, taking the handles to your shoulders. This will be your starting position.",
        "In an athletic stance, squat by flexing your hips and setting your hips back, keeping your arms flexed.",
        "Reverse the motion by powerfully extending through the hips, knees, and ankles, while also extending the elbows to straighten the arms. This movement should be done explosively, coming out of the squat to full extension as powerfully as possible.",
        "Return to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Lateral Box Jump",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "adductors"
      ],
      "secondaryMuscles": [
        "abductors",
        "calves",
        "glutes",
        "hamstrings",
        "quadriceps"
      ],
      "instructions": [
        "Assume a comfortable standing position, with a short box positioned next to you. This will be your starting position.",
        "Quickly dip into a quarter squat to initiate the stretch reflex, and immediately reverse direction to jump up and to the side.",
        "Bring your knees high enough to ensure your feet have good clearance over the box.",
        "Land on the center of the box, using your legs to absorb the impact.",
        "Carefully jump down to the other side of the box, and continue going back and forth for several repetitions."
      ],
      "category": "plyometrics"
    },
    {
      "name": "Leg-Over Floor Press",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Lie on the floor with one kettlebell in place on your chest, holding it by the handle. Extend leg on working side over leg on non-working side.Your free arm can be extended out to your side for support.",
        "Press the kettlebll into a locked out position.",
        "Lower the weight until the elbow touches the ground, keeping the kettlebell above the elbow. Repeat for the desired number of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Leg Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).",
        "Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.",
        "As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.",
        "Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.",
        "Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."
      ],
      "category": "strength"
    },
    {
      "name": "Leverage Incline Chest Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the top of the pectorals at the beginning of the motion. Your chest and head should be up and your shoulder blades retracted. This will be your starting position.",
        "Press the handles forward by extending through the elbow.",
        "After a brief pause at the top, return the weight just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete."
      ],
      "category": "strength"
    },
    {
      "name": "London Bridges",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "lats"
      ],
      "secondaryMuscles": [
        "biceps",
        "forearms",
        "middle back"
      ],
      "instructions": [
        "Attach a climbing rope to a high beam or cross member. Below it, ensure that the smith machine bar is locked in place with the safeties and cannot move. Alternatively, a secure box could also be utilized.",
        "Stand on the bar, using the rope to balance yourself. This will be your starting position.",
        "Keeping your body straight, lean back and lower your body by slowly going hand over hand with the rope. Continue until you are perpendicular to the ground.",
        "Keeping your body straight, reverse the motion, going hand over hand back to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Lunge Sprint",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "Adjust a bar in a Smith machine to an appropriate height. Position yourself under the bar, racking it across the back of your shoulders. Unrack the bar, and then split your feet, moving one foot forward and one foot back. This will be your starting position.",
        "Lower your back knee nearly to the ground, flexing the knees and lowering your hips as you do so.",
        "At the bottom of the descent, immediately reverse direction. Explosively drive through the heel of your front foot with light pressure from your back foot. Jump up and reverse the position of your legs.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Lying Dumbbell Tricep Extension",
      "force": "push",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "chest",
        "shoulders"
      ],
      "instructions": [
        "Lie on a flat bench while holding two dumbbells directly in front of you. Your arms should be fully extended at a 90-degree angle from your torso and the floor. The palms should be facing in and the elbows should be tucked in. This is the starting position.",
        "As you breathe in and you keep the upper arms stationary with the elbows in, slowly lower the weight until the dumbbells are near your ears.",
        "At that point, while keeping the elbows in and the upper arms stationary, use the triceps to bring the weight back up to the starting position as you breathe out.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Lying Hamstring",
      "force": "static",
      "level": "expert",
      "mechanic": null,
      "equipment": "other",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "calves"
      ],
      "instructions": [
        "Lie on your back with your legs extended. Your partner should be kneeling beside you. Raise one leg up towards the ceiling and have your partner hold the ankle. Your partner can use their shoulder to brace your leg if necessary. This will be your starting position.",
        "With your partner holding your leg in place, attempt to flex the knee, contracting the hamstrings for 10-20 seconds.",
        "Then relax your leg, allowing your partner to gently push the leg towards your head. Be sure to inform your helper when the stretch is adequate to prevent injury or overstretching. Switch sides once complete."
      ],
      "category": "stretching"
    },
    {
      "name": "Lying Prone Quadriceps",
      "force": null,
      "level": "expert",
      "mechanic": null,
      "equipment": "body only",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Lay face down on the floor with your partner kneeling beside you. Flex one knee and raise that leg off the ground, attempting to touch your glutes with your foot. Your partner should hold the knee and ankle. This will be your starting position.",
        "Attempt to extend your knee while your partner prevents any actual movement.",
        "After 10-20 seconds, relax your muscles as your partner gently pushes the foot towards your glutes, further stretching the quadriceps and hip flexors.",
        "After 10-20 seconds, switch sides."
      ],
      "category": "stretching"
    },
    {
      "name": "Lying T-Bar Row",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "biceps",
        "lats"
      ],
      "instructions": [
        "Load up the T-bar Row Machine with the desired weight and adjust the leg height so that your upper chest is at the top of the pad. Tip: In some machines all you can do is stand on the appropriate step that allows you to be at a height that has the upper chest at the top of the pad.",
        "Lay face down on the pad and grab the handles. You can either use a palms down, palms up, or palms in position depending on what part of your back you want to emphasize.",
        "Lift the bar off the rack and extend your arms in front of you. This will be your starting position.",
        "As you exhale slowly pull the weight up and squeeze your back at the top of the movement. Tip: Keep the upper arms as close to the torso as possible throughout the movement in order to better engage the back muscles. Also, do not lift your body off of the pad at any time and refrain from using the biceps to lift the weight.",
        "After a second contraction at the top of the movement, as you inhale, slowly go back down to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Machine Bench Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Sit down on the Chest Press Machine and select the weight.",
        "Step on the lever provided by the machine since it will help you to bring the handles forward so that you can grab the handles and fully extend the arms.",
        "Grab the handles with a palms-down grip and lift your elbows so that your upper arms are parallel to the floor to the sides of your torso. Tip: Your forearms will be pointing forward since you are grabbing the handles. Once you bring the handles forward and extend the arms you will be at the starting position.",
        "Now bring the handles back towards you as you breathe in.",
        "Push the handles away from you as you flex your pecs and you breathe out. Hold the contraction for a second before going back to the starting position.",
        "Repeat for the recommended amount of reps.",
        "When finished step on the lever again and slowly get the handles back to their original place."
      ],
      "category": "strength"
    },
    {
      "name": "Medicine Ball Full Twist",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "medicine ball",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [
        "shoulders"
      ],
      "instructions": [
        "For this exercise you will need a medicine ball and a partner. Stand back to back with your partner, spaced 2-3 feet apart. This will be your starting position.",
        "Hold the ball in front of the trunk. Open the hips and turn the shoulders at the same time as your partner.",
        "For full rotation, you and your partner should twist in the same direction, i.e. counter-clockwise.",
        "Pass the ball to your partner, and both of you can now twist in the opposite direction to repeat the procedure."
      ],
      "category": "plyometrics"
    },
    {
      "name": "Monster Walk",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "bands",
      "primaryMuscles": [
        "abductors"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Place a band around both ankles and another around both knees. There should be enough tension that they are tight when your feet are shoulder width apart.",
        "To begin, take short steps forward alternating your left and right foot.",
        "After several steps, do just the opposite and walk backward to where you started."
      ],
      "category": "strength"
    },
    {
      "name": "Muscle Up",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "lats"
      ],
      "secondaryMuscles": [
        "abdominals",
        "biceps",
        "forearms",
        "middle back",
        "shoulders",
        "traps",
        "triceps"
      ],
      "instructions": [
        "Grip the rings using a false grip, with the base of your palms on top of the rings. Initiate a pull up by pulling the elbows down to your side, flexing the elbows.",
        "As you reach the top position of the pull-up, pull the rings to your armpits as you roll your shoulders forward, allowing your elbows to move straight back behind you. This puts you into the proper position to continue into the dip portion of the movement.",
        "Maintaining control and stability, extend through the elbow to complete the motion.",
        "Use care when lowering yourself to the ground."
      ],
      "category": "strength"
    },
    {
      "name": "Narrow Stance Leg Press",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a less-than-shoulder-width narrow stance with the toes slightly pointed out. Your feet should be around 3 inches or less apart. Tip: Keep your head up at all times and also maintain the back on the pad at all times.",
        "Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.",
        "As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.",
        "Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.",
        "Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."
      ],
      "category": "strength"
    },
    {
      "name": "Neck-SMR",
      "force": "static",
      "level": "intermediate",
      "mechanic": null,
      "equipment": "other",
      "primaryMuscles": [
        "neck"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Using a muscle roller or a rolling pin, place the roller behind your head and against your neck. Make sure that you do not place the roller directly against the spine, but turned slightly so that the roller is pressed against the muscles to either side of the spine. This will be your starting position.",
        "Starting at the top of your neck, slowly roll down the muscles of your neck, pausing at points of tension for 10-30 seconds."
      ],
      "category": "stretching"
    },
    {
      "name": "Olympic Squat",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "Begin with a barbell supported on top of the traps. The chest should be up, and the head facing forward. Adopt a hip width stance with the feet turned out as needed.",
        "Descend by flexing the knees, refraining from moving the hips back as much as possible. This requires that the knees travel forward; ensure that they stay aligned with the feet. The goal is to keep the torso as upright as possible. Continue all the way down, keeping the weight on the front of the heel.",
        "At the moment the upper legs contact the lower, reverse the motion, driving the weight upward."
      ],
      "category": "olympic weightlifting"
    },
    {
      "name": "One-Arm Incline Lateral Raise",
      "force": "push",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Lie down sideways on an incline bench press with a dumbbell in the hand. Make sure the shoulder is pressing against the incline bench and the arm is lying across your body with the palm around your navel.",
        "Hold a dumbbell in your uppermost arm while keeping it extended in front of you parallel to the floor. This is your starting position.",
        "While keeping the dumbbell parallel to the floor at all times, perform a lateral raise. Your arm should travel straight up until it is pointing at the ceiling. Tip: Exhale as you perform this movement. Hold the dumbbell in the position and feel the contraction in the shoulders for a second.",
        "While inhaling lower the weight across your body back into the starting position.",
        "Repeat the movement for the prescribed amount of repetitions.",
        "Switch arms and repeat the movement."
      ],
      "category": "strength"
    },
    {
      "name": "One-Arm Kettlebell Military Press To The Side",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "triceps"
      ],
      "instructions": [
        "Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces inward. This will be your starting position.",
        "Look at the kettlebell and press it up and out until it is locked out overhead.",
        "Lower the kettlebell back to your shoulder under control and repeat. Make sure to contract your lat, butt, and stomach forcefully for added stability and strength."
      ],
      "category": "strength"
    },
    {
      "name": "One-Arm Kettlebell Row",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "biceps",
        "lats"
      ],
      "instructions": [
        "Place a kettlebell in front of your feet. Bend your knees slightly and then push your butt out as much as possible as you bend over to get in the starting position. Grab the kettlebell and pull it to your stomach, retracting your shoulder blade and flexing the elbow. Keep your back straight. Lower and repeat."
      ],
      "category": "strength"
    },
    {
      "name": "One-Arm Medicine Ball Slam",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "medicine ball",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [
        "lats",
        "shoulders"
      ],
      "instructions": [
        "Start in a standing position with a staggered, athletic stance. Hold a medicine ball in one hand, on the same side as your back leg. This will be your starting position.",
        "Begin by winding the arm, raising the medicine ball above your head. As you do so, extend through the hips, knees, and ankles to load up for the slam.",
        "At peak extension, flex the shoulders, spine, and hips to throw the ball hard into the ground directly in front of you.",
        "Catch the ball on the bounce and continue for the desired number of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "One-Arm Side Deadlift",
      "force": "pull",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "abdominals",
        "calves",
        "glutes",
        "hamstrings",
        "lower back",
        "traps"
      ],
      "instructions": [
        "Stand to the side of a barbell next to its center. Bend your knees and lower your body until you are able to reach the barbell.",
        "Grasp the bar as if you were grabbing a briefcase (palms facing you since the bar is sideways). You may need a wrist wrap if you are using a significant amount of weight. This is your starting position.",
        "Use your legs to help lift the barbell up while exhaling. Your arms should extend fully as bring the barbell up until you are in a standing position.",
        "Slowly bring the barbell back down while inhaling. Tip: Make sure to bend your knees while lowering the weight to avoid any injury from occurring.",
        "Repeat for the recommended amount of repetitions.",
        "Switch arms and repeat the movement."
      ],
      "category": "strength"
    },
    {
      "name": "One Arm Chin-Up",
      "force": "pull",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "biceps",
        "forearms",
        "lats"
      ],
      "instructions": [
        "For this exercise, start out by placing a towel around a chin up bar.",
        "Grab the chin-up bar with your palm facing you. One hand will be grabbing the chin-up bar and the other will be grabbing the towel.",
        "Bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.v",
        "Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.",
        "After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.",
        "Repeat this motion for the prescribed amount of repetitions.",
        "Switch arms and repeat the movement."
      ],
      "category": "strength"
    },
    {
      "name": "One Arm Lat Pulldown",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "cable",
      "primaryMuscles": [
        "lats"
      ],
      "secondaryMuscles": [
        "biceps",
        "middle back"
      ],
      "instructions": [
        "Select an appropriate weight and adjust the knee pad to help keep you down. Grasp the handle with a pronated grip. This will be your starting position.",
        "Pull the handle down, squeezing your elbow to your side as you flex the elbow.",
        "Pause at the bottom of the motion, and then slowly return the handle to the starting position.",
        "For multiple repetitions, avoid completely returning the weight to keep tension on the muscles being worked."
      ],
      "category": "strength"
    },
    {
      "name": "One Knee To Chest",
      "force": "static",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": null,
      "primaryMuscles": [
        "glutes"
      ],
      "secondaryMuscles": [
        "hamstrings",
        "lower back"
      ],
      "instructions": [
        "Start off by lying on the floor.",
        "Extend one leg straight and pull the other knee to your chest. Hold under the knee joint to protect the kneecap.",
        "Gently tug that knee toward your nose.",
        "Switch sides. This stretches the buttocks and lower back of the bent leg and the hip flexor of the straight leg."
      ],
      "category": "stretching"
    },
    {
      "name": "Overhead Cable Curl",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "cable",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "To begin, set a weight that is comfortable on each side of the pulley machine. Note: Make sure that the amount of weight selected is the same on each side.",
        "Now adjust the height of the pulleys on each side and make sure that they are positioned at a height higher than that of your shoulders.",
        "Stand in the middle of both sides and use an underhand grip (palms facing towards the ceiling) to grab each handle. Your arms should be fully extended and parallel to the floor with your feet positioned shoulder width apart from each other. Your body should be evenly aligned the handles. This is the starting position.",
        "While exhaling, slowly squeeze the biceps on each side until your forearms and biceps touch.",
        "While inhaling, move your forearms back to the starting position. Note: Your entire body is stationary during this exercise except for the forearms.",
        "Repeat for the recommended amount of repetitions prescribed in your program."
      ],
      "category": "strength"
    },
    {
      "name": "Overhead Stretch",
      "force": "static",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": null,
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [
        "chest",
        "forearms",
        "lats",
        "triceps"
      ],
      "instructions": [
        "Standing straight up, lace your fingers together and open your palms to the ceiling. Keep your shoulders down as you extend your arms up.",
        "To create a full torso stretch, pull your tailbone down and stabilize your torso as you do this. Stretch the muscles on both the front and the back of the torso."
      ],
      "category": "stretching"
    },
    {
      "name": "Palms-Down Dumbbell Wrist Curl Over A Bench",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "forearms"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Start out by placing two dumbbells on one side of a flat bench.",
        "Kneel down on both of your knees so that your body is facing the flat bench.",
        "Use your arms to grab both of the dumbbells with a pronated grip (palms facing down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge.",
        "Start out by curling your wrist upwards and exhaling.",
        "Slowly lower your wrists back down to the starting position while inhaling.",
        "Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Palms-Up Dumbbell Wrist Curl Over A Bench",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "forearms"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Start out by placing two dumbbells on one side of a flat bench.",
        "Kneel down on both of your knees so that your body is facing the flat bench.",
        "Use your arms to grab both of the dumbbells with a supinated grip (palms up) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge.",
        "Start out by curling your wrist upwards and exhaling.",
        "Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise.",
        "Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Physioball Hip Bridge",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "exercise ball",
      "primaryMuscles": [
        "glutes"
      ],
      "secondaryMuscles": [
        "hamstrings"
      ],
      "instructions": [
        "Lay on a ball so that your upper back is on the ball with your hips unsupported. Both feet should be flat on the floor, hip width apart or wider. This will be your starting position.",
        "Begin by extending the hips using your glutes and hamstrings, raising your hips upward as you bridge.",
        "Pause at the top of the motion and return to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Piriformis-SMR",
      "force": "static",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "foam roll",
      "primaryMuscles": [
        "glutes"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Sit with your buttocks on top of a foam roll. Bend your knees, and then cross one leg so that the ankle is over the knee. This will be your starting position.",
        "Shift your weight to the side of the crossed leg, rolling over the buttocks until you feel tension in your upper glute. You may assist the stretch by using one hand to pull the bent knee towards your chest. Hold this position for 10-30 seconds, and then switch sides."
      ],
      "category": "stretching"
    },
    {
      "name": "Power Clean from Blocks",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "quadriceps"
      ],
      "instructions": [
        "With a barbell on boxes of the desired height, take a grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.",
        "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. As the bar approaches the mid-thigh position, begin extending through the hips.",
        "In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight. At the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.",
        "As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, pull yourself under the bar far enough that it can be racked onto the shoulders, rotating your elbows under the bar as you do so. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed.",
        "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position, and complete the repetition by returning the weight to the boxes."
      ],
      "category": "olympic weightlifting"
    },
    {
      "name": "Power Partials",
      "force": "push",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso.",
        "The palms of the hands should be facing your torso. Your feet should be about shoulder width apart. This will be your starting position.",
        "Keeping your arms straight and the torso stationary, lift the weights out to your sides until they are about shoulder level height while exhaling.",
        "Feel the contraction for a second and begin to lower the weights back down to the starting position while inhaling. Tip: Keep the palms facing down with the little finger slightly higher while lifting and lowering the weights as it will concentrate the stress on your shoulders mainly.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Preacher Curl",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "barbell",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "To perform this movement you will need a preacher bench and an E-Z bar. Grab the E-Z curl bar at the close inner handle (either have someone hand you the bar which is preferable or grab the bar from the front bar rest provided by most preacher benches). The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar.",
        "With the upper arms positioned against the preacher bench pad and the chest against it, hold the E-Z Curl Bar at shoulder length. This will be your starting position.",
        "As you breathe in, slowly lower the bar until your upper arm is extended and the biceps is fully stretched.",
        "As you exhale, use the biceps to curl the weight up until your biceps is fully contracted and the bar is at shoulder height. Squeeze the biceps hard and hold this position for a second.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Prone Manual Hamstring",
      "force": "static",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": null,
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "You will need a partner for this exercise. Lay face down with your legs straight. Your assistant will place their hand on your heel.",
        "To begin, flex the knee to curl your leg up. Your partner should provide resistance, starting light and increasing the pressure as the movement is completed. Communicate with your partner to monitor appropriate resistance levels.",
        "Pause at the top, returning the leg to the starting position as your partner provides resistance going the other direction."
      ],
      "category": "strength"
    },
    {
      "name": "Push-Ups - Close Triceps Position",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "chest",
        "shoulders"
      ],
      "instructions": [
        "Lie on the floor face down and place your hands closer than shoulder width for a close hand position. Make sure that you are holding your torso up at arms' length.",
        "Lower yourself until your chest almost touches the floor as you inhale.",
        "Using your triceps and some of your pectoral muscles, press your upper body back up to the starting position and squeeze your chest. Breathe out as you perform this step.",
        "After a second pause at the contracted position, repeat the movement for the prescribed amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Pushups",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Lie on the floor face down and place your hands about 36 inches apart while holding your torso up at arms length.",
        "Next, lower yourself downward until your chest almost touches the floor as you inhale.",
        "Now breathe out and press your upper body back up to the starting position while squeezing your chest.",
        "After a brief pause at the top contracted position, you can begin to lower yourself downward again for as many repetitions as needed."
      ],
      "category": "strength"
    },
    {
      "name": "Push Press",
      "force": "push",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "quadriceps",
        "triceps"
      ],
      "instructions": [],
      "category": "olympic weightlifting"
    },
    {
      "name": "Quadriceps-SMR",
      "force": "static",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "foam roll",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Lay facedown on the floor with your weight supported by your hands or forearms. Place a foam roll underneath one leg on the quadriceps, and keep the foot off of the ground. Make sure to relax the leg as much as possible. This will be your starting position.",
        "Shifting as much weight onto the leg to be stretched as is tolerable, roll over the foam from above the knee to below the hip, holding points of tension for 10-30 seconds. Switch sides."
      ],
      "category": "stretching"
    },
    {
      "name": "Rack Pulls",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "lower back"
      ],
      "secondaryMuscles": [
        "forearms",
        "glutes",
        "hamstrings",
        "traps"
      ],
      "instructions": [
        "Set up in a power rack with the bar on the pins. The pins should be set to the desired point; just below the knees, just above, or in the mid thigh position. Position yourself against the bar in proper deadlifting position. Your feet should be under your hips, your grip shoulder width, back arched, and hips back to engage the hamstrings. Since the weight is typically heavy, you may use a mixed grip, a hook grip, or use straps to aid in holding the weight.",
        "With your head looking forward, extend through the hips and knees, pulling the weight up and back until lockout. Be sure to pull your shoulders back as you complete the movement.",
        "Return the weight to the pins and repeat."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Return Push from Stance",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "medicine ball",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "chest",
        "triceps"
      ],
      "instructions": [
        "You will need a partner for this drill.",
        "Begin in an athletic 2 or 3 point stance.",
        "At the signal, move into a position to receive the pass from your partner.",
        "Catch the medicine ball with both hands and immediately throw it back to your partner.",
        "You can modify this drill by running different routes."
      ],
      "category": "plyometrics"
    },
    {
      "name": "Reverse Band Power Squat",
      "force": "push",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "adductors",
        "calves",
        "glutes",
        "hamstrings",
        "lower back"
      ],
      "instructions": [
        "Begin in a power rack with the pins and bar set at the appropriate height. After loading the bar, attach bands to the top of the rack, using either pegs or the frame itself. Attach the other end of the bands to the bar.",
        "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings.",
        "Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.",
        "Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Reverse Barbell Preacher Curls",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "e-z curl bar",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [
        "forearms"
      ],
      "instructions": [
        "Grab an EZ-bar using a shoulder width and palms down (pronated) grip.",
        "Now place the upper part of both arms on top of the preacher bench and have your arms extended. This will be your starting position.",
        "As you exhale, use the biceps to curl the weight up until your biceps are fully contracted and the barbell is at shoulder height. Squeeze the biceps hard for a second at the contracted position.",
        "As you breathe in, slowly lower the barbell until your upper arms are extended and the biceps is fully stretched.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Reverse Plate Curls",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "other",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [
        "forearms"
      ],
      "instructions": [
        "Start by standing straight with a weighted plate held by both hands and arms fully extended. Use a pronated grip (palms facing down) and make sure your fingers grab the rough side of the plate while your thumb grabs the smooth side. Note: For the best results, grab the weighted plate at an 11:00 and 1:00 o'clock position.",
        "Your feet should be shoulder width apart from each other and the weighted plate should be near the groin area. This is the starting position.",
        "Slowly lift the plate up while keeping the elbows in and the upper arms stationary until your biceps and forearms touch while exhaling. The plate should be evenly aligned with your torso at this point.",
        "Feel the contraction for a second and begin to lower the weight back down to the starting position while inhaling",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Rocking Standing Calf Raise",
      "force": "push",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "barbell",
      "primaryMuscles": [
        "calves"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place it on the back of your shoulders (slightly below the neck).",
        "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
        "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance. Also maintain a straight back and keep the knees with a slight bend; never locked. This will be your starting position.",
        "Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending (other than the slight initial bend we created during positioning) at any time. Hold the contracted position by a second before you start to go back down.",
        "Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.",
        "Now lift your toes by contracting the tibia muscles in the front of the calves as you breathe out.",
        "Hold for a second and bring them back down as you breathe in.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Rope Climb",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "lats"
      ],
      "secondaryMuscles": [
        "biceps",
        "forearms",
        "middle back",
        "shoulders"
      ],
      "instructions": [
        "Grab the rope with both hands above your head. Pull down on the rope as you take a small jump.",
        "Wrap the rope around one leg, using your feet to pinch the rope. Reach up as high as possible with your arms, gripping the rope tightly.",
        "Release the rope from your feet as you pull yourself up with your arms, bringing your knees towards your chest.",
        "Resecure your feet on the rope, and then stand up to take another high hold on the rope. Continue until you reach the top of the rope.",
        "To lower yourself, loosen the grip of your feet on the rope as you slide down using a hand over hand motion."
      ],
      "category": "strength"
    },
    {
      "name": "Round The World Shoulder Stretch",
      "force": "static",
      "level": "beginner",
      "mechanic": null,
      "equipment": "other",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "biceps",
        "chest"
      ],
      "instructions": [
        "Stand up straight with your legs together, holding a bodybar or broomstick.",
        "Hold the pole behind your hips with a wider than shoulder width grip. Your palms should be down and your thumbs facing out.",
        "Slowly lift your arms up behind your head. Don't force it if it gets hard to lift further."
      ],
      "category": "stretching"
    },
    {
      "name": "Russian Twist",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [
        "lower back"
      ],
      "instructions": [
        "Lie down on the floor placing your feet either under something that will not move or by having a partner hold them. Your legs should be bent at the knees.",
        "Elevate your upper body so that it creates an imaginary V-shape with your thighs. Your arms should be fully extended in front of you perpendicular to your torso and with the hands clasped. This is the starting position.",
        "Twist your torso to the right side until your arms are parallel with the floor while breathing out.",
        "Hold the contraction for a second and move back to the starting position while breathing out. Now move to the opposite side performing the same techniques you applied to the right side.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Seated Band Hamstring Curl",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "other",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Secure a band close to the ground and place a bench a couple feet away from it.",
        "Seat yourself on the bench and secure the band behind your ankles, beginning with your legs straight. This will be your starting position.",
        "Flex the knees, bringing your feet towards the bench. You may need to lean back slightly to keep your feet from striking the floor.",
        "Pause at the completion of the movement, and then slowly return to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Seated Cable Rows",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "cable",
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "biceps",
        "lats",
        "shoulders"
      ],
      "instructions": [
        "For this exercise you will need access to a low pulley row machine with a V-bar. Note: The V-bar will enable you to have a neutral grip where the palms of your hands face each other. To get into the starting position, first sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.",
        "Lean over as you keep the natural alignment of your back and grab the V-bar handles.",
        "With your arms extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lats as you hold the bar in front of you. This is the starting position of the exercise.",
        "Keeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it until you touch the abdominals. Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard. Hold that contraction for a second and slowly go back to the original position while breathing in.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Seated Calf Stretch",
      "force": "static",
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "calves"
      ],
      "secondaryMuscles": [
        "hamstrings",
        "lower back"
      ],
      "instructions": [
        "Sit up straight on an exercise mat.",
        "Bend one knee and put that foot on the floor to stabilize the torso.",
        "Straighten your other leg and flex your ankle.",
        "Using a band, towel, or your hand if you can reach, pull the toes toward you. Hold for 10 to 20 seconds, then switch sides."
      ],
      "category": "stretching"
    },
    {
      "name": "Seated Dumbbell Palms-Down Wrist Curl",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "forearms"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Start out by placing two dumbbells on the floor in front of a flat bench.",
        "Sit down on the edge of the flat bench with your legs at about shoulder width apart. Make sure to keep your feet on the floor.",
        "Use your arms to grab both of the dumbbells and bring them up so that your forearms are resting against your thighs with the palms of the hands facing down. Your wrists should be hanging over the edge of your thighs.",
        "Start out by curling your wrist upwards and exhaling.",
        "Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Tip: Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.",
        "Repeat for the recommended amount of repetitions.",
        "When finished, simply lower the dumbbells to the floor."
      ],
      "category": "strength"
    },
    {
      "name": "Seated Floor Hamstring Stretch",
      "force": "static",
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "calves"
      ],
      "instructions": [
        "Sit on a mat with your right leg extended in front of you and your left leg bent with your foot against your right inner thigh.",
        "Lean forward from your hips and reach for your ankle until you feel a stretch in your hamstring. Hold for 15 seconds, then repeat for your other side."
      ],
      "category": "stretching"
    },
    {
      "name": "Seated Hamstring",
      "force": "static",
      "level": "expert",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "calves"
      ],
      "instructions": [
        "In a seated position with your legs extended, have your partner stand behind you. Now, lean forward as your partner braces your shoulders with their hands. This will be your starting position.",
        "Attempt to push your torso back for 10-20 seconds, as your partner prevents any actual movement of your torso.",
        "Now relax your muscles as your partner increases the stretch by gently pushing your torso forward for 10-20 seconds."
      ],
      "category": "stretching"
    },
    {
      "name": "Seated Leg Curl",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "machine",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Adjust the machine lever to fit your height and sit on the machine with your back against the back support pad.",
        "Place the back of lower leg on top of padded lever (just a few inches under the calves) and secure the lap pad against your thighs, just above the knees. Then grasp the side handles on the machine as you point your toes straight (or you can also use any of the other two stances) and ensure that the legs are fully straight right in front of you. This will be your starting position.",
        "As you exhale, pull the machine lever as far as possible to the back of your thighs by flexing at the knees. Keep your torso stationary at all times. Hold the contracted position for a second.",
        "Slowly return to the starting position as you breathe in.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Seated Palm-Up Barbell Wrist Curl",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "barbell",
      "primaryMuscles": [
        "forearms"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width.",
        "Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart.",
        "Lean forward and place your forearms on top of your upper thighs with your palms up. Tip: Make sure that the front of the wrists lay on top of your knees. This will be your starting position.",
        "Lower the bar as far as possible while inhaling and keeping a tight grip.",
        "Now curl bar up as high as possible while flexing the forearms and exhaling. Hold the contraction at the top for a second and Tip: Only the wrist should move."
      ],
      "category": "strength"
    },
    {
      "name": "See-Saw Press (Alternating Side Press)",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "abdominals",
        "triceps"
      ],
      "instructions": [
        "Grab a dumbbell with each hand and stand up erect.",
        "Clean (lift) the dumbbells to the chest/shoulder level and then rotate your wrists so that your palms are facing towards you as if you were getting ready to perform an Arnold Press. This will be your starting position.",
        "Now start extending your left arm overhead as you rotate the wrist so that the palm of your hand faces forward as you go up. Your elbows should come out also as you lift the weight. Simultaneously, you will also be bending from your hip to your opposite side. Tip: If you perform the exercise correctly, is should look as if you are trying to reach for something overhead on the right hand side of your body, but with your left arm. Breathe out as you perform this movement.",
        "Once you reach the top position breathe in. Then, with the weight fully extended overhead and you bent over to your right hand side, begin the movement to the left side.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Shoulder Circles",
      "force": "pull",
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "traps"
      ],
      "instructions": [
        "With shoulders relaxed and arms resting loosely at your sides (or in your lap if you're seated), gently roll your shoulders forward, up, back, and down.",
        "Reverse direction. You can do this exercise alternating shoulders or both at the same time."
      ],
      "category": "stretching"
    },
    {
      "name": "Side-Lying Floor Stretch",
      "force": "static",
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "lats"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "First lie on your left side, bending your left knee in front of you to stabilize your torso (use your abdominal muscles as well to hold you upright).",
        "Straighten your right leg and rest the right foot on the floor behind your left. Straighten your right arm over your head and gently pull on your right wrist to stretch the entire right side of the body. Switch sides."
      ],
      "category": "stretching"
    },
    {
      "name": "Side Leg Raises",
      "force": "pull",
      "level": "beginner",
      "mechanic": null,
      "equipment": "body only",
      "primaryMuscles": [
        "adductors"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Stand next to a chair, which you may hold onto as a support. Stand on one leg. This will be your starting position.",
        "Keeping your leg straight, raise it as far out to the side as possible, and swing it back down, allowing it to cross the opposite leg.",
        "Repeat this swinging motion 5-10 times, increasing the range of motion as you do so."
      ],
      "category": "stretching"
    },
    {
      "name": "Side Wrist Pull",
      "force": "static",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": null,
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "forearms",
        "lats"
      ],
      "instructions": [
        "This stretch works best standing. Cross your left arm over the midline of your body and hold the left wrist in your right hand down at the level of your hips. Start the stretch with a bent left arm.",
        "Slowly straighten, pull, and lift it up to shoulder height, as pictured. Feel this stretch originate in your back, not your shoulders, and don't pull too hard on the shoulders joint. Switch sides."
      ],
      "category": "stretching"
    },
    {
      "name": "Sit-Up",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "body only",
      "primaryMuscles": [
        "abdominals"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Lie down on the floor placing your feet either under something that will not move or by having a partner hold them. Your legs should be bent at the knees.",
        "Place your hands behind your head and lock them together by clasping your fingers. This is the starting position.",
        "Elevate your upper body so that it creates an imaginary V-shape with your thighs. Breathe out when performing this part of the exercise.",
        "Once you feel the contraction for a second, lower your upper body back down to the starting position while inhaling.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Sled Overhead Triceps Extension",
      "force": "push",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "other",
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Attach dual handles to a sled using a chain or rope. Load the sled to an appropriate load.",
        "Facing away from the sled, step away until there is tension in the line. Raise your hands above your head, keeping them together, palms facing each other. Your elbows should be pointed upward with the elbows flexed. This will be your starting position.",
        "Extend through the elbow to straighten the arm. Ensure that your upper arm stays in position to isolate the triceps.",
        "Upon full extension, step forward to take the slack out of the line. You may keep your feet staggered for more stability."
      ],
      "category": "strength"
    },
    {
      "name": "Smith Machine Decline Press",
      "force": null,
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Position a decline bench in the rack so that the bar will be above your chest. Load an appropriate weight and take your place on the bench.",
        "Rotate the bar to unhook it from the rack and fully extend your arms. Your back should be slightly arched and your shoulder blades retracted. This will be your starting position.",
        "Begin the movement by flexing your arms, lowering the bar to your chest.",
        "Pause briefly, and then extend your arms to push the weight back to the starting position.",
        "After completing the desired number of repetitions, rotate the bar to rack the weight."
      ],
      "category": "strength"
    },
    {
      "name": "Smith Machine Hang Power Clean",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "glutes",
        "lower back",
        "quadriceps",
        "shoulders",
        "traps"
      ],
      "instructions": [
        "Position the bar at knee height and load it to an appropriate weight.",
        "Take a pronated grip on the bar outside of shoulder width and unhook the bar from the machine. Your arms should be fully extended with your head and chest up. Your elbows should be pointed out with your shoulders back and down. Your hips should be back, loading the tension into the hamstrings. This will be your starting position.",
        "Initate the movement by forcefully extending the hips and knees, accelerating into the bar. Ensure that you keep your arms straight during this part of the motion.",
        "Upon full extension, rebend the hips and knees to lower your receiving position.",
        "Allow the arms to flex at this point, rotating the elbows around the bar to receive it on your shoulders.",
        "Extend through the hips and knees to come to a standing position with the bar racked on your shoulders to complete the movement."
      ],
      "category": "strength"
    },
    {
      "name": "Smith Machine Leg Press",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "Position a Smith machine bar a couple feet off of the ground. Ensure that it is resting on the safeties. After loading the bar to an appropriate weight, lie underneath the bar. Place the middle of your feet on the bar, tucking your knees to your chest. This will be your starting position.",
        "Begin the movement by driving through your feet to move the bar upward, extending the hips and knees. Do not lock out your knees.",
        "At the top of the motion, pause briefly before returning to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Smith Machine Reverse Calf Raises",
      "force": "push",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "machine",
      "primaryMuscles": [
        "calves"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Adjust the barbell on the smith machine to fit your height and align a raised platform right under the bar.",
        "Stand on the platform with the heels of your feet secured on top of it with the balls of your feet extending off it. Position your toes facing forward with a shoulder width stance.",
        "Now, place your shoulders under the barbell while maintaining the foot positioning described and push the barbell up by extending your hips and knees until your torso is standing erect. The knees should be kept with a slight bend; never locked. This will be your starting position. Tip: The barbell on your back is only for balance purposes.",
        "Raise the balls of your feet as you breathe out by extending your toes as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position for a second before you start to go back down.",
        "Slowly go back down to the starting position as you breathe in by lowering the balls of your feet and toes.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Smith Machine Stiff-Legged Deadlift",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "machine",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "glutes",
        "lower back"
      ],
      "instructions": [
        "To begin, set the bar on the smith machine to a height that is around the middle of your thighs. Once the correct height is chosen and the bar is loaded, grasp the bar using a pronated (palms forward) grip that is shoulder width apart. You may need some wrist wraps if using a significant amount of weight.",
        "Lift the bar up by fully extending your arms while keeping your back straight. Stand with your torso straight and your legs spaced using a shoulder width or narrower stance. The knees should be slightly bent. This is your starting position.",
        "Keeping the knees stationary, lower the barbell to over the top of your feet by bending at the waist while keeping your back straight. Keep moving forward as if you were going to pick something from the floor until you feel a stretch on the hamstrings. Exhale as you perform this movement",
        "Start bringing your torso up straight again as soon as you feel the hamstrings stretch by extending your hips and waist until you are back at the starting position. Inhale as you perform this movement.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Snatch",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "biceps",
        "glutes",
        "hamstrings",
        "lower back",
        "shoulders",
        "traps",
        "triceps"
      ],
      "instructions": [
        "Place your feet at a shoulder width stance with the barbell resting right above the connection between the toes and the rest of the foot.",
        "With a palms facing down grip, bend at the knees and keeping the back flat grab the bar using a wider than shoulder width grip. Bring the hips down and make sure that your body drops as if you were going to sit on a chair. This will be your starting position.",
        "Start pushing the floor as if it were a moving platform with your feet and simultaneously start lifting the barbell keeping it close to your legs.",
        "As the bar reaches the middle of your thighs, push the floor with your legs and lift your body to a complete extension in an explosive motion.",
        "Lift your shoulders back in a shrugging movement as you bring the bar up while lifting your elbows out to the side and keeping them above the bar for as long as possible.",
        "Now in a very quick but powerful motion, you have to get your body under the barbell when it has reached a high enough point where it can be controlled and drop while locking your arms and holding the barbell overhead as you assume a squat position.",
        "Finalize the movement by rising up out of the squat position to finish the lift. At the end of the lift both feet should be on line and the arms fully extended holding the barbell overhead."
      ],
      "category": "olympic weightlifting"
    },
    {
      "name": "Speed Box Squat",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "Attach bands to the bar that are securely anchored near the ground. You may need to choke the bands to get adequate tension.",
        "Use a box of an appropriate height for this exercise. Load the bar to a weight that still requires effort, but isn't so heavy that speed is compromised. Typically, that will be between 50-70% of your one rep max.",
        "Position the bar on your upper back, shoulder blades retracted, back arched and everything tight head to toe. This will be the starting position.",
        "Unrack the bar and position yourself in front of the box. Sit back with your hips until you are seated on the box, ensuring that you descend under control and don't crash onto the surface.",
        "Pause briefly, and explode off of the box, extending through the hips and knees."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Spinal Stretch",
      "force": "static",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": null,
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "lats",
        "lower back",
        "neck",
        "traps"
      ],
      "instructions": [
        "Sit in a chair so your back is straight and your feet planted on the floor.",
        "Interlace your fingers behind your head, elbows out and your chin down.",
        "Twist your upper body to one side about 3 times as far as you can. Then lean forward and twist your torso to reach your elbow to the floor on the inside of your knee.",
        "Return to upright position and then repeat for your other side."
      ],
      "category": "stretching"
    },
    {
      "name": "Squat with Chains",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "adductors",
        "calves",
        "glutes",
        "hamstrings",
        "lower back"
      ],
      "instructions": [
        "To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement.",
        "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings. Keep your head facing forward.",
        "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.",
        "Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Standing Barbell Press Behind Neck",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "triceps"
      ],
      "instructions": [
        "This exercise is best performed inside a squat rack for easier pick up of the bar. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
        "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
        "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Your back should be kept straight while performing this exercise. This will be your starting position.",
        "Elevate the barbell overhead by fully extending your arms while breathing out.",
        "Hold the contraction for a second and lower the barbell back down to the starting position by inhaling.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Standing Cable Chest Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "cable",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Position dual pulleys to chest height and select an appropriate weight. Stand a foot or two in front of the cables, holding one in each hand. You can stagger your stance for better stability.",
        "Position the upper arm at a 90 degree angle with the shoulder blades together. This will be your starting position.",
        "Keeping the rest of the body stationary, extend through the elbows to press the handles forward, drawing them together in front of you.",
        "Pause at the top of the motion, and return to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "Standing Dumbbell Reverse Curl",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [
        "forearms"
      ],
      "instructions": [
        "To begin, stand straight with a dumbbell in each hand using a pronated grip (palms facing down). Your arms should be fully extended while your feet are shoulder width apart from each other. This is the starting position.",
        "While holding the upper arms stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the muscle.",
        "Slowly begin to bring the dumbbells back to starting position as your breathe in.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Standing Gastrocnemius Calf Stretch",
      "force": "static",
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "calves"
      ],
      "secondaryMuscles": [
        "hamstrings"
      ],
      "instructions": [
        "Place your right heel on a step with your knee extended and lean forward to grab your right toe with your right hand. Your left knee should be slightly bent and your back should be straight.",
        "Support your weight on your left leg and place your left hand on your left thigh.",
        "Pull your right toes toward your knee until you feel a stretch in your calf."
      ],
      "category": "stretching"
    },
    {
      "name": "Standing Long Jump",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "This drill is best done in sand or other soft landing surface. Ensure that you are able to measure distance. Stand in a partial squat stance with feet shoulder width apart.",
        "Utilizing a big arm swing and a countermovement of the legs, jump forward as far as you can.",
        "Attempt to land with your feet out in front you, reaching as far as possible with your legs.",
        "Measure the distance from your landing point to the starting point and track results."
      ],
      "category": "plyometrics"
    },
    {
      "name": "Standing Olympic Plate Hand Squeeze",
      "force": "static",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "other",
      "primaryMuscles": [
        "forearms"
      ],
      "secondaryMuscles": [
        "biceps"
      ],
      "instructions": [
        "To begin, stand straight while holding a weight plate by the ridge at arm's length in each hand using a neutral grip (palms facing in). You feet should be shoulder width apart from each other. This will be your starting position.",
        "Lower the plates until the fingers are nearly extended but can still hold weights. Inhale as you lower the plates.",
        "Now raise the plates back to the starting position as you exhale by closing your hands.",
        "Repeat for the recommended amount of repetitions prescribed in your program."
      ],
      "category": "strength"
    },
    {
      "name": "Standing Palm-In One-Arm Dumbbell Press",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "triceps"
      ],
      "instructions": [
        "Start by having a dumbbell in one hand with your arm fully extended to the side using a neutral grip. Use your other arm to hold on to an incline bench to keep your balance.",
        "Your feet should be shoulder width apart from each other. Now slowly lift the dumbbell up until you create a 90 degree angle with your arm. Note: Your forearm should be perpendicular to the floor. Continue to maintain a neutral grip throughout the entire exercise.",
        "Slowly lift the dumbbell up until your arm is fully extended. This the starting position.",
        "While inhaling lower the weight down until your arm is at a 90 degree angle again.",
        "Feel the contraction for a second and then lift the weight back up towards the starting position while exhaling. Remember to hold on to the incline bench and keep your feet positioned to keep balance during the exercise.",
        "Repeat for the recommended amount of repetitions.",
        "Switch arms and repeat the exercise."
      ],
      "category": "strength"
    },
    {
      "name": "Standing Pelvic Tilt",
      "force": "static",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": null,
      "primaryMuscles": [
        "lower back"
      ],
      "secondaryMuscles": [
        "glutes"
      ],
      "instructions": [
        "Start off with your feet hip-distance apart.",
        "Bend your knees slightly to keep them soft and springy.",
        "You may want to move your pelvis forward and backward and back few times before holding the tailbone forward in this stretch."
      ],
      "category": "stretching"
    },
    {
      "name": "Step-up with Knee Raise",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "glutes"
      ],
      "secondaryMuscles": [
        "hamstrings",
        "quadriceps"
      ],
      "instructions": [
        "Stand facing a box or bench of an appropriate height with your feet together. This will be your starting position.",
        "Begin the movement by stepping up, putting your left foot on the top of the bench. Extend through the hip and knee of your front leg to stand up on the box. As you stand on the box with your left leg, flex your right knee and hip, bringing your knee as high as you can.",
        "Reverse this motion to step down off the box, and then repeat the sequence on the opposite leg."
      ],
      "category": "strength"
    },
    {
      "name": "Stiff Leg Barbell Good Morning",
      "force": "push",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "lower back"
      ],
      "secondaryMuscles": [
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
        "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
        "Step away from the rack and position your legs using a shoulder width medium stance. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position.",
        "Keeping your legs stationary, move your torso forward by bending at the hips while inhaling. Lower your torso until it is parallel with the floor.",
        "Begin to raise the bar as you exhale by elevating your torso back to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Straight Bar Bench Mid Rows",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "middle back"
      ],
      "secondaryMuscles": [
        "biceps",
        "lats"
      ],
      "instructions": [
        "Place a loaded barbell on the end of a bench. Standing on the bench behind the bar, take a medium, pronated grip. Stand with your hips back and chest up, maintaining a neutral spine. This will be your starting position.",
        "Row the bar to your torso by retracting the shoulder blades and flexing the elbows. Use a controlled movement with no jerking.",
        "After a brief pause, slowly return the bar to the starting position, ensuring to go all the way down."
      ],
      "category": "strength"
    },
    {
      "name": "Sumo Deadlift with Bands",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "adductors",
        "forearms",
        "glutes",
        "lower back",
        "middle back",
        "quadriceps",
        "traps"
      ],
      "instructions": [
        "To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. Ensure that they under the back half of your foot, directly where you are driving into the floor.",
        "Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip.",
        "Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.",
        "As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.",
        "Return the weight to the ground by bending at the hips and controlling the weight on the way down."
      ],
      "category": "powerlifting"
    },
    {
      "name": "Suspended Split Squat",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "abductors",
        "adductors",
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "Suspend your straps so the handles are 18-30 inches from the floor.",
        "Facing away from the setup, place your rear foot into the handle behind you. Keep your head looking forward and your chest up, with your knee slightly bent. This will be your starting position.",
        "Descend by flexing the knee and hips, lowering yourself to the ground. Keep your weight on the heel of your foot and maintain your posture throughout the exercise.",
        "At the bottom of the movement, reverse the motion, extending through the hip and knee to return to the starting position."
      ],
      "category": "strength"
    },
    {
      "name": "The Straddle",
      "force": "static",
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "adductors",
        "calves"
      ],
      "instructions": [
        "Begin in a seated, upright position. Start by extending your legs in front of you in a V.",
        "With your hands on the floor, lean forward as far as possible. Hold for 10 to 20 seconds."
      ],
      "category": "stretching"
    },
    {
      "name": "Trap Bar Deadlift",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "other",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "For this exercise load a trap bar, also known as a hex bar, to an appropriate weight resting on the ground. Stand in the center of the apparatus and grasp both handles.",
        "Lower your hips, look forward with your head and keep your chest up.",
        "Begin the movement by driving through the heels and extend your hips and knees. Avoid rounding your back at all times.",
        "At the completion of the movement, lower the weight back to the ground under control."
      ],
      "category": "strength"
    },
    {
      "name": "Triceps Stretch",
      "force": "static",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": null,
      "primaryMuscles": [
        "triceps"
      ],
      "secondaryMuscles": [
        "lats"
      ],
      "instructions": [
        "Reach your hand behind your head, grasp your elbow and gently pull. Hold for 10 to 20 seconds, then switch sides."
      ],
      "category": "stretching"
    },
    {
      "name": "Two-Arm Kettlebell Clean",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "kettlebells",
      "primaryMuscles": [
        "shoulders"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings",
        "lower back",
        "traps"
      ],
      "instructions": [
        "Place two kettlebells between your feet. To get in the starting position, push your butt back and look straight ahead.",
        "Clean the kettlebells to your shoulders by extending through the legs and hips as you raise the kettlebells towards your shoulders. Rotate your wrists as you do so.",
        "Lower the kettlebells back to the starting position and repeat."
      ],
      "category": "strength"
    },
    {
      "name": "Upper Back-Leg Grab",
      "force": "static",
      "level": "beginner",
      "mechanic": null,
      "equipment": null,
      "primaryMuscles": [
        "hamstrings"
      ],
      "secondaryMuscles": [
        "lower back",
        "middle back"
      ],
      "instructions": [
        "While seated, bend forward to hug your thighs from underneath with both arms.",
        "Keep your knees together and your legs extended out as you bring your chest down to your knees. You can also stretch your middle back by pulling your back away from your knees as your hugging them."
      ],
      "category": "stretching"
    },
    {
      "name": "Upright Row - With Bands",
      "force": "pull",
      "level": "beginner",
      "mechanic": "compound",
      "equipment": "bands",
      "primaryMuscles": [
        "traps"
      ],
      "secondaryMuscles": [
        "shoulders"
      ],
      "instructions": [
        "To begin, stand on an exercise band so that tension begins at arm's length. Grasp the handles using a pronated (palms facing your thighs) grip that is slightly less than shoulder width. The handles should be resting on top of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position.",
        "Use your side shoulders to lift the handles as you exhale. The handles should be close to the body as you move them up. Continue to lift the handles until they nearly touches your chin. Tip: Your elbows should drive the motion. As you lift the handles, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement.",
        "Lower the handles back down slowly to the starting position. Inhale as you perform this portion of the movement.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Weighted Ball Hyperextension",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "exercise ball",
      "primaryMuscles": [
        "lower back"
      ],
      "secondaryMuscles": [
        "glutes",
        "hamstrings",
        "middle back"
      ],
      "instructions": [
        "To begin, lie down on an exercise ball with your torso pressing against the ball and parallel to the floor. The ball of your feet should be pressed against the floor to help keep you balanced. Place a weighted plate under your chin or behind your neck. This is the starting position.",
        "Slowly raise your torso up by bending at the waist and lower back. Remember to exhale during this movement.",
        "Hold the contraction on your lower back for a second and lower your torso back down to the starting position while inhaling.",
        "Repeat for the recommended amount of repetitions prescribed in your program."
      ],
      "category": "strength"
    },
    {
      "name": "Weighted Jump Squat",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings",
        "lower back"
      ],
      "instructions": [
        "Position a lightly loaded barbell across the back of your shoulders. You could also use a weighted vest, sandbag, or other type of resistance for this exercise.",
        "The weight should be light enough that it doesn't slow you down significantly. Your feet should be just outside of shoulder width with your head and chest up. This will be your starting position.",
        "Using a countermovement, squat partially down and immediately reverse your direction to explode off of the ground, extending through your hips, knees, and ankles. Maintain good posture throughout the jump.",
        "As you return to the ground, absorb the impact through your legs."
      ],
      "category": "strength"
    },
    {
      "name": "Wide-Grip Decline Barbell Bench Press",
      "force": "push",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "chest"
      ],
      "secondaryMuscles": [
        "shoulders",
        "triceps"
      ],
      "instructions": [
        "Lie back on a decline bench with the feet securely locked at the front of the bench. Using a wide, pronated (palms forward) grip that is around 3 inches away from shoulder width (for each hand), lift the bar from the rack and hold it straight over you with your arms locked. The bar will be perpendicular to the torso and the floor. This will be your starting position.",
        "As you breathe in, come down slowly until you feel the bar on your lower chest.",
        "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.",
        "Repeat the movement for the prescribed amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Wide-Grip Rear Pull-Up",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "compound",
      "equipment": "body only",
      "primaryMuscles": [
        "lats"
      ],
      "secondaryMuscles": [
        "biceps",
        "middle back",
        "shoulders"
      ],
      "instructions": [
        "Grab the pull-up bar with the palms facing forward using a wide grip.",
        "As you have both arms extended in front of you holding the bar, bring your torso forward and head so that there is an imaginary line from the pull-up bar to the back of your neck. This is your starting position.",
        "Pull your torso up until the bar is near the back of your neck. To do this, draw the shoulders and upper arms down and back while slightly leaning your head forward. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.",
        "After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.",
        "Repeat this motion for the prescribed amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Wrist Circles",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "body only",
      "primaryMuscles": [
        "forearms"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Start by standing straight with your feet being shoulder width apart from each other. Elevate your arms to the side of you until they are fully extended and parallel to the floor at a height that is evenly aligned with your shoulders. Tip: Your torso and arms should form the letter \"T: Your palms should be facing down. This is the starting position.",
        "Keeping your entire body stationary except for the wrists, begin to rotate both wrists forward in a circular motion. Tip: Pretend that you are trying to draw circles by using your hands as the brush. Breathe normally as you perform this exercise.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "stretching"
    },
    {
      "name": "Wrist Rotations with Straight Bar",
      "force": "pull",
      "level": "beginner",
      "mechanic": "isolation",
      "equipment": "barbell",
      "primaryMuscles": [
        "forearms"
      ],
      "secondaryMuscles": [],
      "instructions": [
        "Hold a barbell with both hands and your palms facing down; hands spaced about shoulder width. This will be your starting position.",
        "Alternating between each of your hands, perform the movement by extending the wrist as though you were rolling up a newspaper. Continue alternating back and forth until failure.",
        "Reverse the motion by flexing the wrist, rolling the opposite direction. Continue the alternating motion until failure."
      ],
      "category": "strength"
    },
    {
      "name": "Zercher Squats",
      "force": "push",
      "level": "expert",
      "mechanic": "compound",
      "equipment": "barbell",
      "primaryMuscles": [
        "quadriceps"
      ],
      "secondaryMuscles": [
        "calves",
        "glutes",
        "hamstrings"
      ],
      "instructions": [
        "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. The correct height should be anywhere above the waist but below the chest. Once the correct height is chosen and the bar is loaded, lock your hands together and place the bar on top of your arms in between the forearm and upper arm.",
        "Lift the bar up so that it is resting on top of your forearms. If you are holding the bar properly, it should look as if you have your arms crossed but with a bar running across them.",
        "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
        "Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
        "Begin to raise the bar as you exhale by pushing the floor with the ball of your foot mainly as you straighten the legs again and go back to the starting position.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    },
    {
      "name": "Zottman Preacher Curl",
      "force": "pull",
      "level": "intermediate",
      "mechanic": "isolation",
      "equipment": "dumbbell",
      "primaryMuscles": [
        "biceps"
      ],
      "secondaryMuscles": [
        "forearms"
      ],
      "instructions": [
        "Grab a dumbbell in each hand and place your upper arms on top of the preacher bench or the incline bench. The dumbbells should be held at shoulder height and the elbows should be flexed. Hold the dumbbells with the palms of your hands facing down. This will be your starting position.",
        "As you breathe in, slowly lower the dumbbells keeping the palms down until your upper arm is extended and your biceps are fully stretched.",
        "Now rotate your wrists once you are at the bottom of the movement so that the palms of the hands are facing up.",
        "As you exhale, use your biceps to curl the weights up until they are fully contracted and the dumbbells are at shoulder height. Again, remember that to ensure full contraction you need to bring that small finger higher than the thumb.",
        "Squeeze the biceps hard for a second at the contracted position and rotate your wrists so that the palms are facing down again.",
        "Repeat for the recommended amount of repetitions."
      ],
      "category": "strength"
    }
  ]
}